snlkuharlocal/src/Documents/УслугиСтороннихОрганизаций/УслугиСтороннихОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УслугиСтороннихОрганизаций</name>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоДокументамРасчетов</registerRecords>
  <registerRecords>AccumulationRegister.Затраты</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <registerRecords>AccumulationRegister.РаспределениеУСОпоНакладным</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентЦБ</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокВходящий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокВходящий</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаБух</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипИсполнителя</name>
    <comment>1- поставщик (Кт 60), 2- прочий кредитор (Кт 76)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НДСвключатьВСтоимость</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоДляБухгалтерии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНомерСчетаФактуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>КапитальныеЗатраты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасходов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданСчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КаналСбыта</name>
    <type>
      <types>CatalogRef.КаналСбыта</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДДС</name>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоррСчет</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>СубЗатрата</name>
      <type>
        <types>CatalogRef.СубЗатраты</types>
      </type>
    </attributes>
    <attributes>
      <name>КапитальныеЗатраты</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодРасходов</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонтрагентЛогистика</name>
      <type>
        <types>CatalogRef.Подразделения</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидУслуги</name>
      <type>
        <types>CatalogRef.ВидыУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>КаналСбыта</name>
      <type>
        <types>CatalogRef.КаналСбыта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыТранспортнойкомпании</name>
    <attributes>
      <name>НомерДок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>16</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ЗаявкаВТранспортныйОтдел</types>
        <types>DocumentRef.ПриходнаяНакладная</types>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДок</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>CatalogRef.Регионы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктДоставки</name>
      <type>
        <types>CatalogRef.ПунктыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПериодРасходов</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef.Склады</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/AccumulationRegisters/Взаиморасчеты/Взаиморасчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Взаиморасчеты</name>
  <resources>
    <name>СуммаВал</name>
    <comment>Сумма в рублях</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <comment>Сумма в валюте расчетов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата_НачалаЗадолженности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Документ_ЗакрытогоПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УИД_СтрокиПлатежа</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/AccumulationRegisters/Затраты/Затраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Затраты</name>
  <resources>
    <name>СуммаУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Кассы</types>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасходов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентЛогистика</name>
    <type>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>КаналСбыта</name>
    <type>
      <types>CatalogRef.КаналСбыта</types>
    </type>
  </attributes>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КапитальныеЗатраты</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СубЗатрата</name>
    <type>
      <types>CatalogRef.СубЗатраты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Enums/ТипыДоставки/ТипыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДоставки</name>
  <enumValues>
    <name>Доставка</name>
  </enumValues>
  <enumValues>
    <name>ТранспортнаяКомпания</name>
  </enumValues>
  <enumValues>
    <name>Самовывоз</name>
  </enumValues>
  <enumValues>
    <name>Перегруз</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/УслугиСтороннихОрганизаций/ObjectModule.bsl
//Кухарь 02.06.17 начало   
//будем записывать УСО в закрытом периоде
перем НеКонтролироватьЗапись;
//Кухарь 02.06.17 конец


Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт	
	Если ТолькоДляБухгалтерии Тогда Возврат КонецЕсли;
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	ВалютаУпр		= ?(Дата>='20090101',ПараметрыСеанса.ВалютаУпр_2009,ПараметрыСеанса.ВалютаУпр);	
	КурсУпр			= ПолучитьКурсВалюты_ПоРусски(ВалютаУпр,Дата);
	
	ВалютаРасчетов	= ПолучитьВалютуРасчетов(Договор);	
	
	СуммаВАЛ		= глПересчет(СуммаДокумента,Валюта,Курс,ВалютаРасчетов,Дата);
	СуммаУпр		= глПересчет(СуммаДокумента,Валюта,Курс,ВалютаУпр,КурсУпр);
	
	Движение 					= Движения.Взаиморасчеты.Добавить();
	Движение.ВидДвижения		= ВидДвиженияНакопления.Расход;
	
	Движение.Период				= Дата;
	Движение.Контрагент			= КонтрагентЦБ;
	Движение.Договор 			= Договор;			
	
	Движение.СуммаВал			= СуммаВАЛ;
	Движение.СуммаУпр			= СуммаУпр;
	
	Движение.СуммаДокумента		= СуммаДокумента;
	Движение.ВалютаДокумента	= Валюта;	
	Для Каждого СтрокаТЧ Из Услуги Цикл
		Движение 					= Движения.Затраты.Добавить();
		Движение.ВидДвижения		= ВидДвиженияНакопления.Приход;	
		
		Движение.Период				= Дата;
		
		Движение.Подразделение		= СтрокаТЧ.Подразделение;
		//++Данилова Е.В. 24.04.2026 HELP-9467
		Если Дата >= Дата(2026,04,01) Тогда
			Движение.КаналСбыта 		= СтрокаТЧ.КаналСбыта; 
		КонецЕсли;
		//--Данилова Е.В. 24.04.2026 
		Движение.СтатьяЗатрат		= СтрокаТЧ.СтатьяДДС;			
		
		Движение.СуммаУпр			= глПересчет(СтрокаТЧ.Всего,Валюта,Курс,ВалютаУпр,КурсУпр);		
		
		Движение.Контрагент			= КонтрагентЦБ;
		Движение.Договор			= Договор;
		
		Движение.СуммаДокумента		= СтрокаТЧ.Всего;
		Движение.ВалютаДокумента	= Валюта;	
		Движение.Комментарий        = Комментарий;
		Движение.КапитальныеЗатраты = СтрокаТЧ.КапитальныеЗатраты;
		Движение.Проект             = СтрокаТЧ.Проект;
		Движение.ПериодРасходов     = СтрокаТЧ.ПериодРасходов;
		Движение.СубЗатрата         = СтрокаТЧ.СубЗатрата;
		Движение.Автомобиль         = Автомобиль;		
		Движение.КонтрагентЛогистика = СтрокаТЧ.КонтрагентЛогистика;
		Движение.ДатаЗаписи			= ТекущаяДата();	
	КонецЦикла;	
	
	Если  Дата >= '20130401' тогда
		ПериодРасходовТранспорт = Неопределено;
		Если ЗначениеЗаполнено(ПериодРасходов) Тогда
			ПериодРасходовТранспорт = ПериодРасходов ;
		Иначе	
			Для Каждого СтрокаТЧ Из Услуги Цикл
				Если ЗначениеЗаполнено(СтрокаТЧ.ПериодРасходов) Тогда
					ПериодРасходовТранспорт = СтрокаТЧ.ПериодРасходов ;	
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если ПериодРасходовТранспорт = Неопределено Тогда
				ПериодРасходовТранспорт = '00010101';
			КонецЕсли;
		КонецЕсли;

		СОбъем=ДокументыТранспортнойкомпании.Итог("Объем");	
		ССумма=СуммаДокумента;
		если СОбъем=0 тогда
			СОбъем=1;
		КонецЕсли;
		
		//для коррекции копеек после распределения
		ВсегоРаспределено = 0;
		Движение = Неопределено;
		для каждого СтрУслуги из Услуги цикл
			Коэффициент=СтрУслуги.Всего/СуммаДокумента;
			для каждого Накл из ДокументыТранспортнойкомпании цикл
				если накл.Документ=Неопределено тогда Продолжить;
				КонецЕсли;
				Движение = Движения.РаспределениеУСОпоНакладным.Добавить();
				
				Движение.ВидДвижения		= ВидДвиженияНакопления.Приход;
				
				Движение.Период				=Дата;
				
				Движение.Накладная=накл.Документ.Ссылка;
					Движение.РаспределеннаяСумма=Окр(накл.Объем*ССумма/СОбъем,2);
					Движение.ОбъемНаладной=Накл.Объем;	
				
				//Размазываем отдельно по услугам
				Движение.РаспределеннаяСумма=Движение.РаспределеннаяСумма*Коэффициент;
				Движение.ВидУслуги=СтрУслуги.ВидУслуги;
				//для коррекции копеек после распределения
				ВсегоРаспределено = ВсегоРаспределено + Движение.РаспределеннаяСумма;
				если накл.Документ.метаданные().имя<>"ЗаявкаВТранспортныйОтдел" тогда 
					движение.СуммаНакладной=Накл.Документ.СуммаДокумента;
					попытка
						если ЗначениеЗаполнено(Накл.Документ.ТипДоставки) тогда
							ТипДоставки=Накл.Документ.ТипДоставки;
						иначе
							ТипДоставки=Накл.Документ.ПунктДоставки.ТипДоставки;
						КонецЕсли;
					Исключение
						ТипДоставки=Накл.Документ.ПунктДоставки.ТипДоставки;
					КонецПопытки;
						если ТипДоставки = Перечисления.ТипыДоставки.ТранспортнаяКомпания И НЕ Накл.Документ.ПунктДоставки.ДоставкаЗаНашСчет тогда
							движение.ПунктДоставки=Накл.Документ.ПунктДоставки.ПунктПерегруза;	
						Иначе
							движение.ПунктДоставки=Накл.Документ.ПунктДоставки;	
						КонецЕсли;
				иначе
					движение.СуммаНакладной=0;
					движение.ПунктДоставки=Накл.Документ.ПунктДоставкиПолучатель;
				КонецЕсли;
				
				
				движение.КоличествоНакладной=Накл.Документ.КоличествоДокумента;
				движение.КоличествоКоробок=Накл.Документ.КоличествоКоробок;
				движение.ДатаОтгрузки=Накл.Документ.ДатаОтгрузки;
				Если ЗначениеЗаполнено(Накл.ПериодРасходов) Тогда
					Движение.ПериодРасходов = Накл.ПериодРасходов;
				Иначе
					Движение.ПериодРасходов = ПериодРасходовТранспорт;
				КонецЕсли;
				
				если накл.Документ.метаданные().имя<>"Перемещение" и накл.Документ.метаданные().имя<>"ЗаявкаВТранспортныйОтдел" тогда
					движение.Контрагент=накл.Документ.Контрагент;
					движение.Подразделение=накл.Документ.Подразделение;
				ИначеЕсли накл.Документ.метаданные().имя="ЗаявкаВТранспортныйОтдел" тогда	
					если накл.Документ.отправитель.Метаданные().Имя="Контрагенты" тогда
						движение.Контрагент=накл.Документ.отправитель;
						движение.Подразделение=накл.Документ.Получатель.Подразделение;
					ИначеЕсли накл.Документ.получатель.Метаданные().Имя="Контрагенты" тогда
						движение.Контрагент=накл.Документ.получатель;
						движение.Подразделение=накл.Документ.Отправитель.Подразделение;
					иначе
						движение.Подразделение=накл.Документ.Получатель.Подразделение;				
					КонецЕсли;
					если накл.Документ.Подразделение<>справочники.Подразделения.ПустаяСсылка() тогда
						движение.Подразделение=накл.Документ.Подразделение;
					КонецЕсли;
					
				иначе
					движение.Подразделение=накл.Документ.складполучатель.Подразделение;	
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	Если ВсегоРаспределено <> СуммаДокумента И Движение <> Неопределено И Дата >= '20130701' Тогда
		Движение.РаспределеннаяСумма = Движение.РаспределеннаяСумма + (СуммаДокумента-ВсегоРаспределено);	
	КонецЕсли;
	Если ОбменДанными.Загрузка Тогда
		Движения.Записать();             
	КонецЕсли;
КонецПроцедуры

//СОБЫТИЯ ОБЪЕКТА
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)		
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	ЕстьИзменения		=Модифицированность();
	НужноВыгружать		=НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
	//Кухарь 02.06.17 начало   
	//будем записывать УСО в закрытом периоде         
	если НеКонтролироватьЗапись<>истина тогда
		//Кухарь 02.06.17 конец
		
		
		Если НЕ ОбменДанными.Загрузка Тогда		
			КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
			
			// Кухарь А.Ю.  02.08.2023 начало
			// Стали часто выбирать какой-то неправильный договор
			ВладелецДоговора=ПолучитьРеквизитШапки(Договор,"Владелец","Справочник");
			ВедущийКонтрагента=ПолучитьРеквизитШапки(Контрагент,"Ведущий","Справочник");
			Если ВладелецДоговора<>Контрагент и ВладелецДоговора<>ВедущийКонтрагента тогда
				СообщитьИзМодуля("Выбран договор, владелец которого отличается от контрагента в УСО");
				Отказ = Истина;	
			КонецЕсли;
			// Кухарь А.Ю.  02.08.2023 конец
			
			
			Если Отказ Тогда Возврат КонецЕсли; 		
		КонецЕсли;	
		//кухарь 15.01.15 начало
		//контрагент ЦБ должен быть интегральным
		если КонтрагентЦБ.Владелец<>Справочники.ИБ.НайтиПоКоду("SMN") тогда
			отказ=Истина;
		КонецЕсли;
		//кухарь 15.01.15 конец
		
		
		Если Отказ Тогда Возврат КонецЕсли;
		
		Если ЕстьИзменения Тогда
			СуммаДокумента=Услуги.Итог("Всего");
			//Кухарь 03.10.18 начало
			//По просьбе мамченкова объём будем брать из паллет
			для каждого СтрТЧ из ДокументыТранспортнойкомпании цикл
				Накл=СтрТЧ.Документ;
				попытка
					ОбъемПаллет=Накл.ОбъемПаллет;
				Исключение
					ОбъемПаллет=0;
				КонецПопытки;
				
				Если  Дата >= '20180301' и ОбъемПаллет>0 тогда				
					СтрТЧ.Объем=ОбъемПаллет;			
				ИначеЕсли Накл.ОбъемКоробов=0 тогда			
					СтрТЧ.Объем=Накл.ОбъемДокумента;
					
				иначе				
					СтрТЧ.Объем=Накл.ОбъемКоробов;
				Конецесли;					
				СтрТЧ.КоличествоМест=Накл.КоличествоКоробок;
			КонецЦикла;
			//Кухарь 03.10.18 конец
			
		КонецЕсли; 
		
		//Кухарь 02.06.17 начало   
		//будем записывать УСО в закрытом периоде
		
		//Кухарь 10.10.19 Начало
		//Контроль дублей УСО
		НужноПроверятьДубли=ложь;
		Для каждого СтрТЧ из Услуги цикл
			если ЗначениеЗаполнено(СтрТЧ.ВидУслуги) тогда
				Если СтрТЧ.ВидУслуги.ПроверятьДублиУСО тогда
					НужноПроверятьДубли=Истина;
				КонецЕсли;
			КонецЕсли;
			если НужноПроверятьДубли тогда
				Запрос=новый запрос;
				запрос.Текст="ВЫБРАТЬ
				|	УслугиСтороннихОрганизаций.Ссылка КАК Ссылка
				|ИЗ
				|	Документ.УслугиСтороннихОрганизаций КАК УслугиСтороннихОрганизаций
				|ГДЕ
				|	УслугиСтороннихОрганизаций.Проведен
				|	И УслугиСтороннихОрганизаций.СуммаДокумента = &СуммаДокумента
				|	И УслугиСтороннихОрганизаций.Комментарий ПОДОБНО &Комментарий
				|	И УслугиСтороннихОрганизаций.Автомобиль = &Автомобиль
				|	И УслугиСтороннихОрганизаций.Ссылка <> &Ссылка
				|	И УслугиСтороннихОрганизаций.Дата >= &Дата";
				запрос.УстановитьПараметр("СуммаДокумента",СуммаДокумента);
				запрос.УстановитьПараметр("Комментарий",Комментарий);
				запрос.УстановитьПараметр("Автомобиль",Автомобиль);
				запрос.УстановитьПараметр("Ссылка",Ссылка);
				запрос.УстановитьПараметр("Дата",Константы.ДатаЗапретаРедактирования.Получить()-3*30*3600);
				
				результат=запрос.Выполнить().Выбрать();
				пока результат.Следующий() цикл
					СообщитьИзМодуля("УСО с такой суммой, комментарием и автомобилем уже есть "+результат.ссылка);
					Отказ=Истина;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		//Кухарь 10.10.19 конец			
		
	КонецЕсли;
	//Кухарь 02.06.17 конец
	
	
	//Катаев+ 25/06/13 Убрал комментарии. Проблема в первый раз была из-за того что на самом документе стояла авторегистрация.
	Если НужноВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		ДокОснование		= Основание;
		
		ИБ 					= Основание.ИБ;
		Организация 		= Основание.Организация;
		Подразделение		= Основание.Склад.Подразделение;
		
		Контрагент 			= Основание.Контрагент;
		КонтрагентЦБ		= Контрагент.Ведущий;
		Договор 			= Основание.Договор;		
		
		Сумма 				= Основание.СуммаДокумента;
		Валюта 				= Основание.Валюта;
		
		СтатьяДДС			= Справочники.СтатьиЗатрат.НайтиПоНаименованию("Приход от покупателей");
		
		Комментарий 		= "На основании: "+Основание;		
	КонецЕсли;	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	если не ОбменДанными.Загрузка тогда
		если СозданСчет тогда
			#Если клиент тогда
				Сообщить("На это УСО уже оформлен счет за доставку. Нужно сначала пометить его на удаление");
			#КонецЕсли
			отказ=Истина;
		КонецЕсли;
	КонецЕсли;	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
КонецПроцедуры


//Кухарь 02.06.17 начало   
//будем записывать УСО в закрытом периоде
//Кухарь 02.06.17 конец

Процедура ПерезаписатьДокументБезКонтроля() Экспорт
	НеКонтролироватьЗапись=Истина;	
	Записать(?(Проведен,РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.Запись));
	НеКонтролироватьЗапись=Ложь;	
КонецПроцедуры 

//Кухарь 02.06.17 конец
